'''
คำอธิบาย
มีครูคนหนึ่งได้ตรวจข้อสอบวิชา คณิตศาสตร์ ของนักเรียนในห้องจำนวนหนึ่ง และให้คะแนนเรียบร้อยทุกคน แต่ครูคนนี้ไม่ถนัดวิชา สถิติ จึงได้มาไหว้วานคุณช่วยหาค่าเฉลี่ยของคะแนนวิชา คณิตศาสตร์ ของนักเรียนในห้องครับ
รูปแบบ Input
บรรทัดที่ 1 ใส่จำนวนนักเรียนในห้อง
รูปแบบ Output
บรรทัดที่ 2 ให้ใส่คะแนนนักเรียนที่ได้ของแต่ละคน โดยใส่เครื่องหมาย , คั่นกลาง เช่น 12,42,50 เป็นต้น
'''

# n=int(input())
# point=input()

n=10
point="25,98,89,45,65,67,21,0,30,5"

sum=0.0;
for item in point.split(","):
    sum+=float(item)
sum=sum/n
print("{:.02f}".format(sum))