'''
https://www.borntodev.com/grader/?quizNo=426

คำอธิบาย
โรงเรียนประถมแห่งหนึ่งที่เด็กหญิงชนิกาได้เรียนอยู่นนั้นได้สอนนักเรียนเรื่องผมรวม เช่น ผลรวมตั้ง1ถึง5 เท่ากับ 15
เนื่องด้วยชนิกาเธอเป็นคนขยันเมื่อเธอกลับบ้านมาเธอก็ให้พี่ชายของเธอช่วยติวทั้นที ซึ่งพี่ชายเธอจริงๆแล้วเป็นคนขี้เกียจ
แต่ว่าเป็นคนที่เก่งคณิตศาสตร์เป็นอย่างมากเนื่องด้วยที่ต้องการจะสอนน้องสาวแต่ก็ขี้เกียจคิดเลขและการนั่งกดเครื่องคิดเลข
บวกทีละตัวพี่ชายเธอก็ขี้เกียวเช่นกันพี่ชายเธอจึงมาขอร้องคุณให้ช่วยพัฒนาโปรแกรมหาผลรวมเพื่อช่วยน้องสาวเธอ


รูปแบบ Input
รับค่าจำนวนเต็มมาหนึ่งจำนวน

รูปแบบ Output
แสดงค่าผลรวมของจำนวนเต็มจำนวนนั้นที่บวกกันตั้งแต่หนึ่งถึงตัวมันเอง(1+2+3+4+5+....+n)

input
2
output
3

10 -> 55
'''
a=int(input())
result=0
for i in range(a+1):
    result+=i
print(result)